/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   pointerTest.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: marvin <marvin@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/07/06 19:01:42 by marvin            #+#    #+#             */
/*   Updated: 2020/07/06 19:01:42 by marvin           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>


int main()
{
	int* numPtr;		//포인터 변수 선언
	int num1 = 10;		//int형 변수 저장하고 10 할당.

	numPtr = &num1;		//포인터변수에 num1의 주소값 저장

	printf("p/n", numPtr); //포인터변수의 값 (==주소값)
	printf("p/n", &num1); // 변수 num1의 주소값
	//둘이 동일

	return 0;
}
